# Pandas Merge Fucntion

merge function merges dataframes

merge connects columns or indexes in DataFrame based on one or more keys.

In [17]:
import pandas as pd

In [18]:
df1= pd.DataFrame({'ID': [1,2,3,4], 'Class': [5,6,7,8]})
df1

   ID  Class
0   1      5
1   2      6
2   3      7
3   4      8

In [19]:
df2= pd.DataFrame({'ID': [1,2,3,4], 'Name': ['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [20]:
# we use on='ID' becoz its the only similar key in both dataframes
pd.merge(df1, df2, on='ID')

   ID  Class Name
0   1      5    A
1   2      6    B
2   3      7    C
3   4      8    D

In [21]:
# 'ID' is not same.
df3= pd.DataFrame({'ID': [1,2,3,5], 'Name': ['A','B','C','D']})
pd.merge(df1, df3, on='ID')
# only prints rows with same ID values

   ID  Class Name
0   1      5    A
1   2      6    B
2   3      7    C

In [22]:
# how -> used to specify in what way you want to print merged dataframe
# left - according to left dataframe
# right -
# inner - default
# outer - all values
pd.merge(df1, df3, on='ID', how='outer')

   ID  Class Name
0   1    5.0    A
1   2    6.0    B
2   3    7.0    C
3   4    8.0  NaN
4   5    NaN    D

We use indicator=True if we want to know which value belongs to which column

In [23]:
pd.merge(df1, df3, on='ID', how='outer', indicator=True)

   ID  Class Name      _merge
0   1    5.0    A        both
1   2    6.0    B        both
2   3    7.0    C        both
3   4    8.0  NaN   left_only
4   5    NaN    D  right_only

In [24]:
df4= pd.DataFrame({'ID': [5,6,7,8], 'Name': ['A','B','C','D']})
df4

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

We use left_index/right_index to print data with not similar key value and print the dataframe with 2 diffrent key set.

In [15]:
pd.merge(df1,df4, left_index=True, right_index=True)

   ID_x  Class  ID_y Name
0     1      5     5    A
1     2      6     6    B
2     3      7     7    C
3     4      8     8    D

In [16]:
pd.merge(df1,df4, on='ID', how='outer')

   ID  Class Name
0   1    5.0  NaN
1   2    6.0  NaN
2   3    7.0  NaN
3   4    8.0  NaN
4   5    NaN    A
5   6    NaN    B
6   7    NaN    C
7   8    NaN    D

In [25]:
df5= pd.DataFrame({'ID': [5,6,7,8], 'Name': ['A','B','C','D']})
df5

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [27]:
# df4 and df5 are identical
# if both dataframes are same we can change heading of col 
# suffixes= ('_x', '_y')
pd.merge(df4,df5, on='ID')

   ID Name_x Name_y
0   5      A      A
1   6      B      B
2   7      C      C
3   8      D      D

In [29]:
pd.merge(df4,df5, on='ID', suffixes= ('_First', '_Last'))

   ID Name_First Name_Last
0   5          A         A
1   6          B         B
2   7          C         C
3   8          D         D